# Вывести последнюю букву в слове
word = 'Архангельск'
# ???
print(word[-1])

# Вывести количество букв "а" в слове
word = 'Архангельск'
# ???
print(word.lower().count('а'))

# Вывести количество гласных букв в слове
word = 'Архангельск'
# ???
for letter in word:
    print(letter)

# Вывести количество слов в предложении
sentence = 'Мы приехали в гости'
# ???
print(len(sentence))

# Вывести первую букву каждого слова на отдельной строке
sentence = 'Мы приехали в гости'
# ???


# Вывести усреднённую длину слова в предложении
sentence = 'Мы приехали в гости'
# ???